目的: インシデントを解決するエージェントの進捗状況を説明したい
ターゲット: 社員

1. ビジネスインパクトのある改善をしたかった（目的・背景）
2. インシデント対応エージェントを作った（手段） 
3. うまくいかなかった。なぜか？（問い） 
4. そもそもインシデント対応とは何かを改めて整理した 
	1. アラート対応とインシデント対応は別物 
	2. インシデント自体も複数種類ある 
	3. 「解決」は思ったより広くて曖昧な概念だった（←ここが山場） 
5. 解決ではなく、人のフォローに焦点を絞り直した（方針転換） 
6. 結果・学び・次のステップ（締め）


`肉付け`

各セクションで何を伝えたいかを一言でまとめる。
なぜなら、文章のブレを無くす。一言があることで文章の基準になる。

1. ビジネスインパクトのある改善をしたかった（目的・背景）
属人化したインシデント対応をAIエージェントに置き換え、運用改善ができる取り組みを目標にしている。

2. インシデント対応エージェントを作った（手段） 
ユーザー報告やアラート管理のSaaS(PD)情報からインシデントの調査、解決案の提案してくれるエージェント作成を目指していた。

3. うまくいかなかった。なぜか？（問い） 
120以上システムがあり、言語、フレームワーク、インフラのアーキテクチャ、ログの形式、ビジネスルールなどの違いや過去のインシデント調査履歴が散布または存在しなかった。


4. そもそもインシデント対応とは何かを改めて整理した 
	1. アラート対応とインシデント対応は別物 
		アラート対応はユーザー報告やアラート管理のSaaSに気づいた瞬間からの対応で、インシデント対応はユーザー影響が発生したと人が判断してからの対応。

	2. インシデント自体も複数種類ある 
		PagerDutyに集約されているアラートを分類した場合、大項目で7つ、小項目は35項目ほどある。

	3. 「解決」は思ったより広くて曖昧な概念だった（←ここが山場） 
		目的は運用改善、解決をする前に誰でもアラート対応ができる方が価値があるかもしれないと判断した。

1. 解決ではなく、人のフォローに焦点を絞り直した（方針転換） 
2. 結果・学び・次のステップ（締め）


